spec/support/vcr_cassettes/claims_api/bgs/benefit_claim_web_service/find_bnft_claim.yml

---
http_interactions:
- request:
    method: post
    uri: "<BGS_BASE_URL>/BenefitClaimWebServiceBean/BenefitClaimWebService"
    body:
      encoding: UTF-8
      string: |
        <?xml version="1.0" encoding="UTF-8"?>
          <env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://benefitclaim.services.vetsnet.vba.va.gov/" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
          <env:Header>
          <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <wsse:UsernameToken>
              <wsse:Username>VAgovAPI</wsse:Username>
            </wsse:UsernameToken>
            <vaws:VaServiceHeaders xmlns:vaws="http://vbawebservices.vba.va.gov/vawss">
              <vaws:CLIENT_MACHINE>127.0.0.1</vaws:CLIENT_MACHINE>
              <vaws:STN_ID>281</vaws:STN_ID>
              <vaws:applicationName>VAgovAPI</vaws:applicationName>
              <vaws:ExternalUid>xUid</vaws:ExternalUid>
              <vaws:ExternalKey>xKey</vaws:ExternalKey>
            </vaws:VaServiceHeaders>
          </wsse:Security>
        </env:Header>

          <env:Body>
            <tns:findBnftClaim><bnftClaimId>600100330</bnftClaimId>
        </tns:findBnftClaim>
          </env:Body>
          </env:Envelope>
    headers:
      User-Agent:
      - "<FARADAY_VERSION>"
      Content-Type:
      - text/xml;charset=UTF-8
      Host:
      - ".vba.va.gov"
      Soapaction:
      - '"findBnftClaim"'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Fri, 07 Mar 2025 18:34:15 GMT
      Server:
      - Apache
      X-Frame-Options:
      - SAMEORIGIN
      Transfer-Encoding:
      - chunked
      Content-Type:
      - text/xml; charset=utf-8
      Strict-Transport-Security:
      - max-age=16000000; includeSubDomains; preload;
    body:
      encoding: UTF-8
      string: <?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><env:Header><work:WorkContext
        xmlns:work="http://oracle.com/weblogic/soap/workarea/">rO0ABXdTAB13ZWJsb2dpYy5hcHAuQ29ycG9yYXRlRGF0YUVBUgAAANYAAAAjd2VibG9naWMud29ya2FyZWEuU3RyaW5nV29ya0NvbnRleHQABTMuNS43AAA=</work:WorkContext></env:Header><S:Body><ns0:findBnftClaimResponse
        xmlns:ns0="http://benefitclaim.services.vetsnet.vba.va.gov/"><BnftClaimDTO><bnftClaimId>600100330</bnftClaimId><bnftClaimTypeCd>400SUPP</bnftClaimTypeCd><bnftClaimTypeLabel>Compensation</bnftClaimTypeLabel><bnftClaimTypeNm>eBenefits
        526EZ-Supplemental (400)</bnftClaimTypeNm><bnftClaimUserDisplay>YES</bnftClaimUserDisplay><claimJrsdtnLctnId>322</claimJrsdtnLctnId><claimRcvdDt>2017-04-24T00:00:00-05:00</claimRcvdDt><claimSuspnsDt>2017-05-24T10:54:20-05:00</claimSuspnsDt><cpClaimEndPrdctTypeCd>409</cpClaimEndPrdctTypeCd><jrnDt>2021-03-02T13:55:18-06:00</jrnDt><jrnLctnId>281</jrnLctnId><jrnObjId>cd_clm_ptcpnt_pkg.do_create</jrnObjId><jrnStatusTypeCd>U</jrnStatusTypeCd><jrnUserId>VAgovAPI</jrnUserId><payeeTypeCd>00</payeeTypeCd><payeeTypeNm>Veteran</payeeTypeNm><pgmTypeCd>CPL</pgmTypeCd><pgmTypeNm>Compensation-Pension
        Live</pgmTypeNm><ptcpntClmantId>600036156</ptcpntClmantId><ptcpntClmantNm>BROOKS
        JERRY</ptcpntClmantNm><ptcpntDpositAcntId>56960</ptcpntDpositAcntId><ptcpntMailAddrsId>15125513</ptcpntMailAddrsId><ptcpntVetId>600036156</ptcpntVetId><ptcpntVsrId>600276939</ptcpntVsrId><scrtyLevelTypeCd>5</scrtyLevelTypeCd><stationOfJurisdiction>281</stationOfJurisdiction><statusTypeCd>CAN</statusTypeCd><statusTypeNm>Cancelled</statusTypeNm><svcTypeCd>CP</svcTypeCd><tempJrsdtnLctnId>359</tempJrsdtnLctnId><temporaryStationOfJurisdiction>330</temporaryStationOfJurisdiction><termnlDigitNbr>37</termnlDigitNbr></BnftClaimDTO></ns0:findBnftClaimResponse></S:Body></S:Envelope>
  recorded_at: Fri, 07 Mar 2025 18:34:15 GMT
recorded_with: VCR 6.3.1
